Revit 2027 API
LeaderArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Leader this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Leader
	Get
	Set
public:
virtual property Leader^ Item[int index] {
	Leader^ get (int index);
	void set (int index, Leader^ value);
}
abstract Item : Leader with get, set
override Item : Leader with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
Leader
Returns the object at the specified index.
See Also
Reference
LeaderArray Class
Autodesk.Revit.DB Namespace